<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Sublime Text update.</string>
    <key>Identifier</key>
    <string>com.github.apeelsciences.recipes.download.sublime</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SublimeText3</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://www.sublimetext.com/updates/3/stable/appcast_osx.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
            </dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Sublime Text.app</string>
                <key>requirement</key>
                <string>identifier "com.sublimetext.3" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Z6D26JE4Y4</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
    </array>
</dict>
</plist>
