<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Octave DMG by searching sourceforge update RSS for latest download URL</string>
    <key>Identifier</key>
    <string>com.github.apeelsciences.recipes.download.octave</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MNova</string>
        <key>SEARCH_URL</key>
        <string>https://sourceforge.net/projects/octave/rss?path=/Octave%20MacOSX%20Binary/</string>
        <key>SEARCH_PATTERN</key>
        <string>(https://sourceforge.net/projects/octave/files/Octave%20MacOSX%20Binary/.*download)</string>
                       
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
       
        
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>

        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>