<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Avast update and imports latest Avast update into Munki Apeel catalog.</string>
    <key>Identifier</key>
    <string>com.github.apeelsciences.recipes.munki.avast</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Avast</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/avast</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>Apeel</string>
            </array>
            <key>description</key>
            <string>Avast Security is a free antivirus that stops malware and finds Wi-Fi security weaknesses.</string>
            <key>category</key>
            <string>Productivity</string>
            <key>display_name</key>
            <string>Avast</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apeelsciences.recipes.download.avast</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
