<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of MestReNova and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.apeelsciences.recipes.munki.mnova</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MNova</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/mnova</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>Apeel</string>
			</array>
			<key>description</key>
			<string>A top class software suite to process your analytical chemistry data</string>
			<key>category</key>
            <string>Communication</string>
			<key>developer</key>
			<string>MESTRELAB RESEARCH, S.L.</string>
			<key>display_name</key>
			<string>MestReNova</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.apeelsciences.recipes.download.mnova</string>
	<key>Process</key>
	    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
