<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Box Edit and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.apeelsciences.recipes.munki.boxedit</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/box</string>
        <key>NAME</key>
        <string>Box Edit</string>
        <key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
        <string>true</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Box</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>Apeel</string>
            </array>
            <key>display_name</key>
            <string>Box Edit</string>
            <key>category</key>
            <string>Productivity</string>
            <key>developer</key>
            <string>Box</string>
            <key>description</key>
            <string>Box Edit lets you easily edit files on Box using the native applications installed on your computer. If you can edit it on your desktop, you can edit it on Box! Just click the ‘Open’ button in the file preview page to open any file directly from Box.</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apeelsciences.recipes.munki.boxedit</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>