<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports latest version of Box Sync into Munki Apeel catalog hopefully</string>

    <key>Identifier</key>
    <string>com.github.apeelsciences.recipes.munki.boxsync</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Box Sync</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/box</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>Apeel</string>
            </array>
            <key>description</key>
            <string>Box Sync is a productivity tool that allows you to mirror data stored on Box to your desktop. You can then navigate and modify content stored on the Box website through your computer’s native file browsing interface, without using a web browser. Content that syncs down to your computer are available for offline access. If you make changes to the synced files locally, these changes automatically sync back up to your Box account.</string>
            <key>category</key>
            <string>Internet</string>
            <key>display_name</key>
            <string>Box Sync</string>
            <key>developer</key>
            <string>Box Inc.</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apeelsciences.recipes.download.boxsync</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
