<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Slack update and imports latest Slack update into Munki Apeel catalog.</string>

    <key>Identifier</key>
    <string>com.github.alexnagase.recipes.munki.slack</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Slack</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/slack</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>Apeel</string>
            </array>
            <key>description</key>
            <string>Slack is a platform for team communication: everything in one place, instantly searchable, available wherever you go.</string>
            <key>category</key>
            <string>Communication</string>
            <key>display_name</key>
            <string>Slack</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.alexnagase.recipes.download.slack</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
