<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of OhausRecorder from Box and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.apeelsciences.recipes.munki.OhausRecorder</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/ohausrecorder</string>
		<key>NAME</key>
		<string>OhausRecorder</string>
		<key>MUNKI_CATEGORY</key>
		<string>Tools</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>Apeel</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Need an application whose convenience is majorly outweighed by its unreliability? This is the app for you. As Steve likes to say when using this to measure fruit masses in an organized and automated fashion, “Tim, it’s super broken again.”
			</string>
			<key>developer</key>
			<string>Apeel</string>
			<key>display_name</key>
			<string>OhausRecorder</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.apeelsciences.recipes.pkg.OhausRecorder</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>