<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of GIMP from gimp.org and imports into Apeel Munki.</string>
    <key>Identifier</key>
    <string>com.github.apeelsciences.recipes.munki.GIMP</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GIMP</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/GIMP</string>
        <key>MUNKI_CATEGORY</key>
        <string>Productivity</string>
        <key>pkginfo</key>
        <dict>
            <key>blocking_applications</key>
            <array>
                <string>Gimp</string>
                <string>GIMP</string>
            </array>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>GIMP is the GNU Image Manipulation Program. It is a freely distributed piece of software for such tasks as photo retouching, image composition and image authoring. It works on many operating systems, in many languages.</string>
            <key>developer</key>
            <string>The GIMP Team</string>
            <key>display_name</key>
            <string>GIMP</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>unattended_uninstall</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.2</string>
    <key>ParentRecipe</key>
    <string>com.github.apeelsciences.recipes.download.GIMP</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Comment</key>
            <string>GIMP binary has execute bits only for owner. This needs to be fixed before MunkiImporter.</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/GIMP.app</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/GIMP.app</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>GIMPPermissionsFixer</string>
            <key>Arguments</key>
            <dict>
                <key>gimp_app_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/GIMP.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
