<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports latest Grasshopper version into Munki Apeel catalog.</string>

    <key>Identifier</key>
    <string>com.github.alexnagase.recipes.munki.grasshopper</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Grasshopper</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/grasshopper</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>Apeel</string>
            </array>
            <key>description</key>
            <string>With the Grasshopper Desktop App you now have the freedom and flexibility to work from anywhere. Use your internet connection to make and receive calls and text messages, view call history and respond to clients efficiently.</string>
            <key>category</key>
            <string>Communication</string>
            <key>display_name</key>
            <string>Grasshopper</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.alexnagase.recipes.download.grasshopper</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
