<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest resp monitor zip file from Box and builds a package. The installer package includes a preinstall script that will check for an existing RespirationMonitor.app in /Applications and remove it if found.</string>
    <key>Identifier</key>
    <string>com.github.apeelsciences.recipes.pkg.RespirationMonitor</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>RespirationMonitor</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.apeelsciences.recipes.download.RespirationMonitor</string>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Get RespirationMonitor version from the app contents</string>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/RespirationMonitor/RespirationMonitor.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>com.apeel.respmon</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>